## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_subnet.subnet must be replaced
-/+ resource "azurerm_subnet" "subnet" {
      ~ enforce_private_link_endpoint_network_policies = false -> (known after apply)
      ~ enforce_private_link_service_network_policies  = false -> (known after apply)
      ~ id                                             = "/subscriptions/a61f90e1-d9c8-4c9c-9cd5-0a904a50cf48/resourceGroups/yuan0037-a12-rg/providers/Microsoft.Network/virtualNetworks/my-vnet/subnets/my-subnet" -> (known after apply)
        name                                           = "my-subnet"
      ~ private_endpoint_network_policies_enabled      = true -> (known after apply)
      ~ private_link_service_network_policies_enabled  = true -> (known after apply)
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
      ~ virtual_network_name                           = "my-vnet" -> "cdo8918w24vnet" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # azurerm_virtual_network.vnet must be replaced
-/+ resource "azurerm_virtual_network" "vnet" {
      ~ dns_servers             = [] -> (known after apply)
      - flow_timeout_in_minutes = 0 -> null
      ~ guid                    = "4abe7e47-393c-4045-81cd-12962f03cde2" -> (known after apply)
      ~ id                      = "/subscriptions/a61f90e1-d9c8-4c9c-9cd5-0a904a50cf48/resourceGroups/yuan0037-a12-rg/providers/Microsoft.Network/virtualNetworks/my-vnet" -> (known after apply)
      ~ name                    = "my-vnet" -> "cdo8918w24vnet" # forces replacement
      ~ subnet                  = [
          - {
              - address_prefix = "10.0.1.0/24"
              - id             = "/subscriptions/a61f90e1-d9c8-4c9c-9cd5-0a904a50cf48/resourceGroups/yuan0037-a12-rg/providers/Microsoft.Network/virtualNetworks/my-vnet/subnets/my-subnet"
              - name           = "my-subnet"
              - security_group = ""
            },
        ] -> (known after apply)
      - tags                    = {} -> null
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```
</details>